<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Mozilla Firefox ESR for Mac.</string>
	<key>Identifier</key>
	<string>com.github.gilbertpalau-recipes.download.FirefoxESR-Mac</string>
    	<key>Process</key>
    	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>This recipe is now non-functional. Please remove it from your list of recipes.</string>
			</dict>
			<key>Processor</key>
			<string>com.github.gregneagle.autopkg.sharedprocessors/DeprecationWarning</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>TRUEPREDICATE</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
    </array>
</dict>
</plist>
