<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
       <key>Processor</key>
       <string>com.github.gregneagle.autopkg.sharedprocessors/DeprecationWarning</string>
       <key>Arguments</key>
         <dict>
            <key>warning_message</key>
            <string>This recipe is now non-functional. Please remove it from your list of recipes.</string>
         </dict>
</dict>
	
<dict>   
            <key>Processor</key>   
            <string>StopProcessingIf</string>   
            <key>Arguments</key>   
            <dict>   
                <key>predicate</key>   
                <string>TRUEPREDICATE</string>
            </dict>
        </dict>
	
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Mozilla Firefox ESR for Mac.</string>
	<key>Identifier</key>
	<string>com.github.gilbertpalau-recipes.download.FirefoxESR-Mac</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Firefox ESR</string>
		<key>DOWNLOAD_URL</key>
<string>https://download.mozilla.org/?product=firefox-esr-latest&amp;os=osx&amp;lang=en-US</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.download.firefox-rc-en_US</string>
    	<key>MinimumVersion</key>
    	<string>0.4.1</string>
    	<key>Process</key>
    	<array>
        	<dict>
            	<key>Arguments</key>
            	<dict>
                	<key>product_name</key>
                	<string>firefox</string>
                	<key>release</key>
                	<string>%RELEASE%</string>
                	<key>locale</key>
                	<string>%LOCALE%</string>
            	</dict>
                <key>Processor</key>
                <string>MozillaURLProvider</string>
        	</dict>
        	<dict>
            	<key>Arguments</key>
            	<dict>
                	<key>filename</key>
                	<string>%NAME%.dmg</string>
            	</dict>
            	<key>Processor</key>
            	<string>URLDownloader</string>
        	</dict>
        	<dict>
            	<key>Processor</key>
            	<string>EndOfCheckPhase</string>
        	</dict>
        	<dict>
            	<key>Processor</key>
            	<string>CodeSignatureVerifier</string>
            	<key>Arguments</key>
            	<dict>
                	<key>input_path</key>
                	<string>%pathname%/Firefox.app</string>
                	<key>requirement</key>
                	<string>anchor apple generic and certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "43AQ936H96"</string>
            	</dict>
        	</dict>
    </array>
</dict>
</plist>
