<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads FileWave Lightning 1.8.7</string>
    <key>Identifier</key>
    <string>com.github.gilbertpalau.fwvlightning.download.recipe</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FileWaveLightning</string>
        <key>DOWNLOAD_URL</key>
        <string>http://fwdl.filewave.com/lightning/FileWave_Lightning-1.8.7.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.1.0</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>This recipe is now non-functional. Please remove it from your list of recipes.</string>
			</dict>
			<key>Processor</key>
			<string>com.github.gregneagle.autopkg.sharedprocessors/DeprecationWarning</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>TRUEPREDICATE</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
    </array>
</dict>
</plist>
