<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads FileWave Lightning 1.8.7</string>
    <key>Identifier</key>
    <string>com.github.gilbertpalau.fwvlightning.download.recipe</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FileWaveLightning</string>
        <key>DOWNLOAD_URL</key>
        <string>http://fwdl.filewave.com/lightning/FileWave_Lightning-1.8.6.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.1.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
