<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of FileWave Lightning and imports into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.gilbertpalau.fwvlightning.download.recipe</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>FileWave Lightning</string>
		<key>FW_FILESET_GROUP</key>
		<string>Autpkg</string>
		<key>SPARKLE_FEED_URL</key>
		<string>http://downloads.filewave.com/lightning/FileWave_Lightning-1.8.3.dmg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>ParentRecipe</key>
	<string>com.github.gilbertpalau.fwvlightning.download.recipe</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.johncclayton.filewave.FWTool/FileWaveImporter</string>
			<key>Arguments</key>
			<dict>
				<!-- specify the bundle ID & version in order to get FileWave
					 to check for duplicate imports.  This only works for
					 filesets imported by AutoPkg, not for filesets you added to
					 FileWave by hand -->

				<key>fw_app_bundle_id</key>
				<string>com.lightning.Filewave</string>

				<key>fw_app_version</key>
				<string>%version%</string>

				<key>fw_import_source</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.app</string>

				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>

				<key>fw_fileset_group</key>
				<string>Mac Desktop</string>

				<key>fw_destination_root</key>
				<string>/Applications/%NAME%.app</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
